# 1. ⽣生成⼀一个包含100个key的字典，每个value的值不能⼀一样
dict_1 = {}
for i in range(100):
    if i < 100:
        dict_1[f"k{i}"] = i
print(dict_1)

# 2. {‘k0’: 0, ‘k1’: 1, ‘k2’: 2, ‘k3’: 3, ‘k4’: 4, ‘k5’: 5, ‘k6’: 6, ‘k7’: 7, ‘k8’: 8, ‘k9’: 9} 请把这个dict中key⼤大于5的
# 值value打印出来。
dict_2 = {'k0': 0, 'k1': 1, 'k2': 2, 'k3': 3, 'k4': 4, 'k5': 5, 'k6': 6, 'k7': 7, 'k8': 8, 'k9': 9}
for i in dict_2.values():
    if i > 5:
        print(i)
print("=" * 50)
# 3. 把题2中value是偶数的统⼀一改成-1
for i in dict_2.values():
    if i % 2 == 0:
        print(i)
    #     dict_2[v] = -1
    # print(dict_2)

print("=" * 50)
for k, v in dict_2.items():
    if v % 2 == 0:
        dict_2[k] = -1
        print(k, v)
print(dict_2)
print(dict_2.items())

# 4. 请设计⼀一个dict, 存储你们公司每个⼈人的信息， 信息包含⾄至少姓名、年龄、电话、职位、工资，并
# 提供⼀一个简单的查找接⼝，用户按你的要求输⼊入要查找的⼈人，你的程序把查到的信息

dict_4 = {1: ["郭德刚", 46, 1200888888, "班主", 1000000], 2: ["于谦", 51, 1108888888, "于大爷", 999999], 3: ["侯震", 39, 18708723218,"少侯爷", 988762],
          4: ["孙越", 42, 18708723219, "孙胖子", 978954], 5: ["高峰", 42, 18708723212, "总教习", 988888], 6: ["史爱东", 39, 187087232323, "东先生", 988762],
          7: ["栾云平", 37, 18708723228, "栾恁恁", 968954], 8: ["岳云鹏", 36, 18708723212, "小岳岳", 988889], 9: ["郭麒麟", 26, 187087432323, " 少班主", 999999],
          10: ["张云雷", 25, 1300885488, "小辫儿", 800000], 11: ["朱云峰", 34, 1708884388, "烧饼", 888888], 12: ["孟鹤堂", 33, 1508884388, " 堂主", 895034],
          13: ["张鹤伦", 35, 18708723618, "小白", 709808],
          14: ["阎鹤祥", 42, 14708723213, " 壮壮", 790872], 15: ["杨九郎", 28, 187087243242, "九馕", 603842],
          16: ["曹鹤阳", 32, 187087232323, "小四", 603432],
          17: ["郎鹤焱", 35, 18703423228, "大黄", 502874], 18: ["周九良", 26, 1870874234212, "小先生", 543092],
          19: ["刘筱亭", 21, 18703412323, " 二哥", 430285]}

dict_4_id = int(input("请输入您喜欢的相声演员ID："))
for k, v in dict_4.items():             # print(dict_4_id)# print(dict_4.keys())
    if dict_4_id == k:
        print(dict_4[k])


name = input("请输入您喜欢的相声演员姓名或职务： ")
for k, v in dict_4.items():
    if name in v:
        print(v)

